These are five Oscar-nominated (Best Picture, 2022) movies and their IMDB, Rotten tomatoes and Metacritic scores respectively:

CODA: 8.1, 96, 75
Belfast: 7.4, 87, 75
King Richard: 7.6, 90, 76
Licorice Pizza: 7.9, 91, 90
Dune: 8.1, 83, 74
    
Create a dataframe, df, that stores these three types of scores with axis labels as respective movie names and column labels as 'IMDB', 'Rotten tomatoes' and 'Metacritic' respectively. (2 points)
Name the df's index as 'movies' and its columns as 'scores'. (1 point)
Use df to display the metacritic scores of CODA and Dune. (1 point)
Sort df by movie names. (1 point)
Sort df by score names. (1 point)
Sort df by IMDB scores in descending order. (1 point)
Sort df first by Metacritic scores and next by Rotten Tomatoes scores. (1 point)
Update df to change the IMDB score for 'Licorice Pizza' to 8.5. (1 point)
Drop 'King Richard' from df. (1 point)

Create a dataframe, df, that stores these three types of scores with axis labels as respective movie names and column labels as 'IMDB', 'Rotten tomatoes' and 'Metacritic' respectively. (2 points)

In [1]:
import pandas as pd
from pandas import Series, DataFrame

In [2]:
import numpy as np

In [3]:
oscars_data = {'IMDB' : [8.1,7.4,7.6,7.9,8.1],
              'Rotten tomatoes' : [96,87,90,91,83],
              'Metacritic' : [75,75,76,90,74]}
df=DataFrame(oscars_data, index=['Coda','Belfast','King Richard','Licorice Pizza','Dune'])
df

                IMDB  Rotten tomatoes  Metacritic
Coda             8.1               96          75
Belfast          7.4               87          75
King Richard     7.6               90          76
Licorice Pizza   7.9               91          90
Dune             8.1               83          74

Name the df's index as 'movies' and its columns as 'scores'. (1 point)

In [4]:
df.index.name='movies'
df.columns.name='scores'
df

scores          IMDB  Rotten tomatoes  Metacritic
movies
Coda             8.1               96          75
Belfast          7.4               87          75
King Richard     7.6               90          76
Licorice Pizza   7.9               91          90
Dune             8.1               83          74

Use df to display the metacritic scores of CODA and Dune. (1 point)

In [5]:
df.loc[['Coda','Dune'],['Metacritic']]

scores  Metacritic
movies
Coda            75
Dune            74

Sort df by movie names. (1 point)

In [6]:
df.sort_index()

scores          IMDB  Rotten tomatoes  Metacritic
movies
Belfast          7.4               87          75
Coda             8.1               96          75
Dune             8.1               83          74
King Richard     7.6               90          76
Licorice Pizza   7.9               91          90

Sort df by score names. (1 point)

In [7]:
df.sort_index(axis='columns')

scores          IMDB  Metacritic  Rotten tomatoes
movies
Coda             8.1          75               96
Belfast          7.4          75               87
King Richard     7.6          76               90
Licorice Pizza   7.9          90               91
Dune             8.1          74               83

Sort df by IMDB scores in descending order. (1 point)

In [8]:
df.sort_values(by='IMDB', ascending=False)

scores          IMDB  Rotten tomatoes  Metacritic
movies
Coda             8.1               96          75
Dune             8.1               83          74
Licorice Pizza   7.9               91          90
King Richard     7.6               90          76
Belfast          7.4               87          75

Sort df first by Metacritic scores and next by Rotten Tomatoes scores. (1 point)

In [9]:
df.sort_values(by=['Metacritic','Rotten tomatoes'])

scores          IMDB  Rotten tomatoes  Metacritic
movies
Dune             8.1               83          74
Belfast          7.4               87          75
Coda             8.1               96          75
King Richard     7.6               90          76
Licorice Pizza   7.9               91          90

Update df to change the IMDB score for 'Licorice Pizza' to 8.5. (1 point)

In [10]:
df.loc[['Licorice Pizza'],['IMDB']]=8.5
df

scores          IMDB  Rotten tomatoes  Metacritic
movies
Coda             8.1               96          75
Belfast          7.4               87          75
King Richard     7.6               90          76
Licorice Pizza   8.5               91          90
Dune             8.1               83          74

Drop 'King Richard' from df. (1 point)

In [11]:
df.drop(['King Richard'])

scores          IMDB  Rotten tomatoes  Metacritic
movies
Coda             8.1               96          75
Belfast          7.4               87          75
Licorice Pizza   8.5               91          90
Dune             8.1               83          74